#ifndef FLUFF_ENEMYBASE_H
#define FLUFF_ENEMYBASE_H

#include "types.h"
#include "object/FlfGameObj.h"
#include "demo/EventDemoAttachment.h"
#include "object/collision/IObjHitCB.h"
#include "object/MoveTarget.h"
#include "gfl/gflTask.h"

/// @brief Base class for enemies and similar entities.
/// @note Size: `0x1774`
class EnemyBase : public FlfGameObj, public IObjHitCB, public demo::EventDemoAttachment {
public:

    

    EnemyBase(gfl::Task* pParentTask, uint arg2, uint arg3, const char* pArg4);


    /* EnemyBase */

    /* 0x094 */ virtual void vf094();
    /* 0x098 */ virtual void vf098();
    /* 0x09C */ virtual void vf09C();
    /* 0x0A0 */ virtual void vf0A0();
    /* 0x0A4 */ virtual void vf0A4();
    /* 0x0A8 */ virtual void vf0A8();
    /* 0x0AC */ virtual void vf0AC();
    /* 0x0B0 */ virtual void vf0B0();
    /* 0x0B4 */ virtual void vf0B4();
    /* 0x0B8 */ virtual void vf0B8();
    /* 0x0BC */ virtual void vf0BC();
    /* 0x0C0 */ virtual void vf0C0();
    /* 0x0C4 */ virtual void vf0C4();
    /* 0x0C8 */ virtual void vf0C8();
    /* 0x0CC */ virtual void vf0CC();
    /* 0x0D0 */ virtual void vf0D0();
    /* 0x0D4 */ virtual void vf0D4();
    /* 0x0D8 */ virtual void vf0D8();
    /* 0x0DC */ virtual void vf0DC();
    /* 0x0E0 */ virtual void vf0E0();
    /* 0x0E4 */ virtual void vf0E4();
    /* 0x0E8 */ virtual void vf0E8();
    /* 0x0EC */ virtual void vf0EC();
    /* 0x0F0 */ virtual void vf0F0();
    /* 0x0F4 */ virtual void vf0F4();
    /* 0x0F8 */ virtual void vf0F8();
    /* 0x0FC */ virtual void vf0FC();
    /* 0x100 */ virtual void vf100();
    /* 0x104 */ virtual void vf104();
    /* 0x108 */ virtual void vf108();
    /* 0x10C */ virtual void vf10C();
    /* 0x110 */ virtual void vf110();
    /* 0x114 */ virtual void vf114();
    /* 0x118 */ virtual void vf118();
    /* 0x11C */ virtual void vf11C();
    /* 0x120 */ virtual void vf120();
    /* 0x124 */ virtual void vf124();
    /* 0x128 */ virtual void vf128();
    /* 0x12C */ virtual void vf12C();
    /* 0x130 */ virtual void vf130();
    /* 0x134 */ virtual void vf134();
    /* 0x138 */ virtual void vf138();
    /* 0x13C */ virtual void vf13C();
    /* 0x140 */ virtual void vf140();
    /* 0x144 */ virtual void vf144();
    /* 0x148 */ virtual void vf148();
    /* 0x14C */ virtual void vf14C();
    /* 0x150 */ virtual void vf150();
    /* 0x154 */ virtual void vf154();
    /* 0x158 */ virtual void vf158();
    /* 0x15C */ virtual void vf15C();
    /* 0x160 */ virtual void vf160();
    /* 0x164 */ virtual void vf164();
    /* 0x168 */ virtual void vf168();
    /* 0x16C */ virtual void vf16C();
    /* 0x170 */ virtual void vf170();
    /* 0x174 */ virtual void vf174();
    /* 0x178 */ virtual void vf178();
    /* 0x17C */ virtual void vf17C();
    /* 0x180 */ virtual void vf180();
    /* 0x184 */ virtual void vf184();
    /* 0x188 */ virtual void vf188();
    /* 0x18C */ virtual void vf18C();
    /* 0x190 */ virtual void vf190();
    /* 0x194 */ virtual void vf194();
    /* 0x198 */ virtual void vf198();
    /* 0x19C */ virtual void vf19C();
    /* 0x1A0 */ virtual void vf1A0();
    /* 0x1A4 */ virtual void vf1A4();
    /* 0x1A8 */ virtual void vf1A8();
    /* 0x1AC */ virtual void vf1AC();
    /* 0x1B0 */ virtual void vf1B0();
    /* 0x1B4 */ virtual void vf1B4();
    /* 0x1B8 */ virtual void vf1B8();
    /* 0x1BC */ virtual void vf1BC();
    /* 0x1C0 */ virtual void vf1C0();
    /* 0x1C4 */ virtual void vf1C4();
    /* 0x1C8 */ virtual void vf1C8();
    /* 0x1CC */ virtual void vf1CC();
    /* 0x1D0 */ virtual void vf1D0();
    /* 0x1D4 */ virtual void vf1D4();
    /* 0x1D8 */ virtual void vf1D8();
    /* 0x1DC */ virtual void vf1DC();
    /* 0x1E0 */ virtual void vf1E0();
    /* 0x1E4 */ virtual void vf1E4();
    /* 0x1E8 */ virtual void vf1E8();
    /* 0x1EC */ virtual void vf1EC();
    /* 0x1F0 */ virtual void vf1F0();
    /* 0x1F4 */ virtual void vf1F4();
    /* 0x1F8 */ virtual void vf1F8();
    /* 0x1FC */ virtual void vf1FC();
    /* 0x200 */ virtual void vf200();
    /* 0x204 */ virtual void vf204();
    /* 0x208 */ virtual void vf208();
    /* 0x20C */ virtual void vf20C();
    /* 0x210 */ virtual void vf210();
    /* 0x214 */ virtual void vf214();
    /* 0x218 */ virtual void vf218();
    /* 0x21C */ virtual void vf21C();
    /* 0x220 */ virtual void vf220();
    /* 0x224 */ virtual void vf224();
    /* 0x228 */ virtual void vf228();
    /* 0x22C */ virtual void vf22C();
    /* 0x230 */ virtual void vf230();
    /* 0x234 */ virtual void vf234();
    /* 0x238 */ virtual void vf238();
    /* 0x23C */ virtual void vf23C();
    /* 0x240 */ virtual void vf240();
    /* 0x244 */ virtual void vf244();
    /* 0x248 */ virtual void vf248();
    /* 0x24C */ virtual void vf24C();
    /* 0x250 */ virtual void vf250();
    /* 0x254 */ virtual void vf254();
    /* 0x258 */ virtual void vf258();
    /* 0x25C */ virtual void vf25C();
    /* 0x260 */ virtual void vf260();
    /* 0x264 */ virtual void vf264();
    /* 0x268 */ virtual void vf268();
    /* 0x26C */ virtual void vf26C();
    /* 0x270 */ virtual void vf270();
    /* 0x274 */ virtual void vf274();
    /* 0x278 */ virtual void vf278();
    /* 0x27C */ virtual void vf27C();
    /* 0x280 */ virtual void vf280();
    /* 0x284 */ virtual void vf284();
    /* 0x288 */ virtual void vf288();
    /* 0x28C */ virtual void vf28C();
    /* 0x290 */ virtual void vf290();
    /* 0x294 */ virtual void vf294();
    /* 0x298 */ virtual void vf298();
    /* 0x29C */ virtual void vf29C();
    /* 0x2A0 */ virtual void vf2A0();
    /* 0x2A4 */ virtual void vf2A4();
    /* 0x2A8 */ virtual void vf2A8();
    /* 0x2AC */ virtual void vf2AC();
    /* 0x2B0 */ virtual void vf2B0();
    /* 0x2B4 */ virtual void vf2B4();
    /* 0x2B8 */ virtual void vf2B8();
    /* 0x2BC */ virtual void vf2BC();
    /* 0x2C0 */ virtual void vf2C0();
    /* 0x2C4 */ virtual void vf2C4();
    /* 0x2C8 */ virtual void vf2C8();
    /* 0x2CC */ virtual void vf2CC();
    /* 0x2D0 */ virtual void vf2D0();
    /* 0x2D4 */ virtual void vf2D4();
    /* 0x2D8 */ virtual void vf2D8();
    /* 0x2DC */ virtual void vf2DC();
    /* 0x2E0 */ virtual void vf2E0();
    /* 0x2E4 */ virtual void vf2E4();
    /* 0x2E8 */ virtual void vf2E8();
    /* 0x2EC */ virtual void vf2EC();
    /* 0x2F0 */ virtual void vf2F0();
    /* 0x2F4 */ virtual void vf2F4();
    /* 0x2F8 */ virtual void vf2F8();
    /* 0x2FC */ virtual void vf2FC();
    /* 0x300 */ virtual void vf300();
    /* 0x304 */ virtual void vf304();
    /* 0x308 */ virtual void vf308();
    /* 0x30C */ virtual void vf30C();
    /* 0x310 */ virtual void vf310();
    /* 0x314 */ virtual int vf314();
    /* 0x318 */ virtual void vf318();
    /* 0x31C */ virtual void vf31C();
    /* 0x320 */ virtual void vf320();
    /* 0x324 */ virtual void vf324();
    /* 0x328 */ virtual void vf328();
    /* 0x32C */ virtual void vf32C();
    /* 0x330 */ virtual void vf330();
    /* 0x334 */ virtual void vf334();
    /* 0x338 */ virtual void vf338();
    /* 0x33C */ virtual void vf33C();
    /* 0x340 */ virtual void vf340();
    /* 0x344 */ virtual void vf344();
    /* 0x348 */ virtual void vf348();
    /* 0x34C */ virtual void vf34C();
    /* 0x350 */ virtual void vf350();
    /* 0x354 */ virtual void vf354();
    /* 0x358 */ virtual void vf358();
    /* 0x35C */ virtual void vf35C();
    /* 0x360 */ virtual void vf360();
    /* 0x364 */ virtual void vf364();
    /* 0x368 */ virtual void vf368();
    /* 0x36C */ virtual void vf36C();
    /* 0x370 */ virtual void vf370();
    /* 0x374 */ virtual void vf374();
    /* 0x378 */ virtual void vf378();
    /* 0x37C */ virtual void vf37C();
    /* 0x380 */ virtual void vf380();
    /* 0x384 */ virtual void vf384();
    /* 0x388 */ virtual void vf388();
    /* 0x38C */ virtual void vf38C();
    /* 0x390 */ virtual void vf390();
    /* 0x394 */ virtual void vf394();
    /* 0x398 */ virtual void vf398();
    /* 0x39C */ virtual void vf39C();
    /* 0x3A0 */ virtual void vf3A0();
    /* 0x3A4 */ virtual void vf3A4();
    /* 0x3A8 */ virtual void vf3A8();
    /* 0x3AC */ virtual void vf3AC();
    /* 0x3B0 */ virtual void vf3B0();
    /* 0x3B4 */ virtual void vf3B4();
    /* 0x3B8 */ virtual void vf3B8();
    /* 0x3BC */ virtual void vf3BC();
    /* 0x3C0 */ virtual void vf3C0();
    /* 0x3C4 */ virtual void vf3C4();
    /* 0x3C8 */ virtual void vf3C8();
    /* 0x3CC */ virtual void vf3CC();
    /* 0x3D0 */ virtual void vf3D0();
    /* 0x3D4 */ virtual void vf3D4();
    /* 0x3D8 */ virtual void vf3D8();
    /* 0x3DC */ virtual void vf3DC();
    /* 0x3E0 */ virtual void vf3E0();
    /* 0x3E4 */ virtual void vf3E4();
    /* 0x3E8 */ virtual void vf3E8();
    /* 0x3EC */ virtual void vf3EC();
    /* 0x3F0 */ virtual void vf3F0();
    /* 0x3F4 */ virtual void vf3F4();
    /* 0x3F8 */ virtual void vf3F8();
    /* 0x3FC */ virtual void vf3FC();
    /* 0x400 */ virtual void vf400();
    /* 0x404 */ virtual void vf404();
    /* 0x408 */ virtual void vf408();
    /* 0x40C */ virtual void vf40C();
    /* 0x410 */ virtual void vf410();
    /* 0x414 */ virtual void vf414();
    /* 0x418 */ virtual void vf418();
    /* 0x41C */ virtual void vf41C();
    /* 0x420 */ virtual void vf420();
    /* 0x424 */ virtual void vf424();
    /* 0x428 */ virtual void vf428();
    /* 0x42C */ virtual void vf42C();
    /* 0x430 */ virtual void vf430();
    /* 0x434 */ virtual void vf434();
    /* 0x438 */ virtual void vf438();
    /* 0x43C */ virtual void vf43C();
    /* 0x440 */ virtual void vf440();
    /* 0x444 */ virtual void vf444();
    /* 0x448 */ virtual void vf448();
    /* 0x44C */ virtual void vf44C();
    /* 0x450 */ virtual void vf450();
    /* 0x454 */ virtual void vf454();
    /* 0x458 */ virtual void vf458();
    /* 0x45C */ virtual void vf45C();
    /* 0x460 */ virtual void vf460();
    /* 0x464 */ virtual void vf464();
    /* 0x468 */ virtual void vf468();
    /* 0x46C */ virtual void vf46C();
    /* 0x470 */ virtual void vf470();
    /* 0x474 */ virtual void vf474();
    /* 0x478 */ virtual void vf478();
    /* 0x47C */ virtual void vf47C();
    /* 0x480 */ virtual void vf480();
    /* 0x484 */ virtual void vf484();
    /* 0x488 */ virtual void vf488();
    /* 0x48C */ virtual void vf48C();
    /* 0x490 */ virtual void vf490();
    /* 0x494 */ virtual void vf494();
    /* 0x498 */ virtual void vf498();
    /* 0x49C */ virtual void vf49C();
    /* 0x4A0 */ virtual void vf4A0();
    /* 0x4A4 */ virtual void vf4A4();
    /* 0x4A8 */ virtual void vf4A8();
    /* 0x4AC */ virtual void vf4AC();
    /* 0x4B0 */ virtual void vf4B0();
    /* 0x4B4 */ virtual void vf4B4();
    /* 0x4B8 */ virtual void vf4B8();
    /* 0x4BC */ virtual void vf4BC();
    /* 0x4C0 */ virtual void vf4C0();
    /* 0x4C4 */ virtual void vf4C4();
    /* 0x4C8 */ virtual void vf4C8();
    /* 0x4CC */ virtual void vf4CC();
    /* 0x4D0 */ virtual void vf4D0();
    /* 0x4D4 */ virtual void vf4D4();
    /* 0x4D8 */ virtual void vf4D8();
    /* 0x4DC */ virtual void vf4DC();
    /* 0x4E0 */ virtual void vf4E0();
    /* 0x4E4 */ virtual void vf4E4();
    /* 0x4E8 */ virtual void vf4E8();
    /* 0x4EC */ virtual void vf4EC();
    /* 0x4F0 */ virtual void vf4F0();
    /* 0x4F4 */ virtual void vf4F4();
    /* 0x4F8 */ virtual void vf4F8();
    /* 0x4FC */ virtual void vf4FC();
    /* 0x500 */ virtual void vf500();
    /* 0x504 */ virtual void vf504();
    /* 0x508 */ virtual void vf508();
    /* 0x50C */ virtual void vf50C();
    /* 0x510 */ virtual void vf510();
    /* 0x514 */ virtual void vf514();
    /* 0x518 */ virtual void vf518();
    /* 0x51C */ virtual void vf51C();
    /* 0x520 */ virtual void vf520();
    /* 0x524 */ virtual void vf524();
    /* 0x528 */ virtual void vf528();
    /* 0x52C */ virtual void vf52C();
    /* 0x530 */ virtual void vf530();
    /* 0x534 */ virtual void vf534();
    /* 0x538 */ virtual void vf538();
    /* 0x53C */ virtual void vf53C();
    /* 0x540 */ virtual void vf540();
    /* 0x544 */ virtual void vf544();
    /* 0x548 */ virtual void vf548();
    /* 0x54C */ virtual void vf54C();
    /* 0x550 */ virtual void vf550();
    /* 0x554 */ virtual void vf554();
    /* 0x558 */ virtual void vf558();
    /* 0x55C */ virtual void vf55C();
    /* 0x560 */ virtual void vf560();
    /* 0x564 */ virtual void vf564();
    /* 0x568 */ virtual void vf568();
    /* 0x56C */ virtual void vf56C();
    /* 0x570 */ virtual void vf570();
    /* 0x574 */ virtual void vf574();
    /* 0x578 */ virtual void vf578();
    /* 0x57C */ virtual void vf57C();
    /* 0x580 */ virtual void vf580();
    /* 0x584 */ virtual void vf584();
    /* 0x588 */ virtual void vf588();
    /* 0x58C */ virtual void vf58C();
    /* 0x590 */ virtual void vf590();
    /* 0x594 */ virtual void vf594();
    /* 0x598 */ virtual void vf598();
    /* 0x59C */ virtual void vf59C();
    /* 0x5A0 */ virtual void vf5A0();
    /* 0x5A4 */ virtual void vf5A4();

    /* overrides */

    /* 0x08 */ virtual ~EnemyBase();

    /* -> FlfGameObj */
    /* 0x00C */ virtual void SetPosition(nw4r::math::VEC3& rPos) override;
    /* 0x010 */ virtual void vf10(bool arg1) override;
    /* 0x014 */ virtual nw4r::math::VEC3 GetPosition() override;
    /* 0x020 */ virtual void SetSecondaryPosition(nw4r::math::VEC3& rPos) override;
    /* 0x028 */ virtual void vf28() override;
    /* 0x02C */ virtual void vf2C(nw4r::math::VEC3& rArg1, nw4r::math::VEC3& rArg2, nw4r::math::VEC3& rArg3) override;
    /* 0x034 */ virtual bool ShouldCull(CameraManager* pCamMgr) override;
    /* 0x03C */ virtual int vf3C() override;
    /* 0x04C */ virtual void SetState(FlfGameObj* pSetter, const std::string& rState) override;
    /* 0x064 */ virtual void UpdateWater(bool) override;

    /* -> IObjHitCB */
    /* 0x70 */ virtual int vf8() override;

    /* -> demo::EventDemoAttachment */

    /* 0x080 */ virtual void vfC() override;
    /* 0x084 */ virtual void vf10() override;
    /* 0x088 */ virtual int  vf14_() override;
    /* 0x08C */ virtual void vf18() override;
    /* 0x090 */ virtual void vf1C() override;


    /* Class Members */
    
    /* 0x090 */ int m_90;
    /* 0x094 */ int m_94;
    /* 0x098 */ int m_98;
    /* 0x09C */ int m_9C;
    /* 0x0A0 */ int m_A0;
    /* 0x0A4 */ int m_A4;
    /* 0x0A8 */ int m_A8;
    /* 0x0AC */ int m_AC;
    /* 0x0B0 */ int m_B0;
    /* 0x0B4 */ nw4r::math::VEC3 m_B4;
    /* 0x0C0 */ int m_C0;
    /* 0x0C4 */ int m_C4;
    /* 0x0C8 */ int m_C8;
    /* 0x0CC */ int m_CC;
    /* 0x0D0 */ int m_D0;
    /* 0x0D4 */ int m_D4;
    /* 0x0D8 */ int m_D8;
    /* 0x0DC */ int m_DC;
    /* 0x0E0 */ int m_E0;
    /* 0x0E4 */ int m_E4;
    /* 0x0E8 */ int m_E8;
    /* 0x0EC */ int m_EC;
    /* 0x0F0 */ MoveTarget mMoveTargets[2]; // @ 0xF0
    /* 0x180 */ int m_180;
    /* 0x184 */ int m_184;
    /* 0x18C */ int m_18C;
    /* 0x190 */ int m_190;
    /* 0x194 */ nw4r::math::MTX44 m_194;
    /* 0x1D4 */ nw4r::math::VEC2 m_1D4;
    /* 0x1DC */ nw4r::math::VEC2 m_1DC;
    /* 0x1E4 */ STRUCT_FILL(0x1774 - 464);
};

// ASSERT_SIZE(EnemyBase, 0x1774);

#endif
